podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SPI0_MK21F12.svd.xml
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TXFR%s</name>
               <description>Transmit FIFO</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TXCMD_TXDATA</name>
                     <description>Transmit Command or Transmit Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>RXFR%s</name>
               <description>Receive FIFO</description>
               <addressOffset>0x7C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Receive Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
